Project/Toir/src/InformationRegisters/торо_СтатусыРемонтовВЗаявках/торо_СтатусыРемонтовВЗаявках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтовВЗаявках</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКСтатусу</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРемонт</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовЗаявокУстановленные/торо_СтатусыДокументовЗаявокУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовЗаявокУстановленные</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устраняется</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ВыполненНеобходимАктПриемки</name>
  </enumValues>
  <enumValues>
    <name>гкс_Новый</name>
    <comment>TOIR20-673</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеЗаявки</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявокУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ППРИнициатор</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеЗаявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonModules/торо_РаботаСоСтатусамиДокументовСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_РаботаСоСтатусамиДокументовСервер: методы, для работы со статусами документов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура - Установить статус документа.
// Процедура предназначена для установки статуса документа. 
//
// Параметры:
//  Ссылка	-	ДокументСсылка.торо_ВыявленныеДефекты,
//				ДокументСсылка.торо_ВнешнееОснованиеДляРабот,
//				ДокументСсылка.торо_ЗаявкаНаРемонт, 
//				ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//				ДокументСсылка.торо_НарядНаРегламентноеМероприятие - Ссылка на документ для которого требуется установить статус.
//  Регистратор	-	ДокументСсылка.торо_АктОВыполненииЭтапаРабот,
//					ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия,
//					ДокументСсылка.торо_ЗаявкаНаРемонт, 
//					ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//					ДокументСсылка.тоо_ЗакрытиеЗаявокИРемонтов - Ссылка на документ для которого требуется установить статус.
//  Движения - РегистрСведенийНаборЗаписей.торо_СтатусыДокументовВыявленныхДефектов 
//							- Движения для записи статуса в регистр.
//  Статус	 - ПеречислениеСсылка.торо_СтатусыДокументов - Статус устанавливаемый для документа.
//  СтатусУстановлен - Булево - Означает что текущий статус является наибольшим на момент проведения.
Процедура УстановитьСтатусДокумента(Ссылка, Регистратор, Движения, Статус, СтатусУстановлен = Истина) Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраПоСсылке(Ссылка);
	
	Движение = Вычислить("Движения." + ИмяРегистра + ".Добавить()");
		
	Движение.Период 					= Регистратор.Дата;
	Движение.ИзменяемыйДокумент		= Ссылка;
	Движение.СтатусДокумента 			= Статус;
	Движение.СтатусУстановлен			= СтатусУстановлен;
	Выполнить("Движения." + ИмяРегистра + ".Записывать = Истина;");
	
	Если СтатусУстановлен Тогда
		Движение = Вычислить("Движения." + ИмяРегистра + "Установленные.Добавить()");
		Движение.Период 					= Регистратор.Дата;
		Движение.ИзменяемыйДокумент	= Ссылка;
		Движение.СтатусДокумента 		= Статус;
		Выполнить("Движения." + ИмяРегистра + "Установленные.Записывать = Истина;");
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") И Ссылка <> Регистратор Тогда
		
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
			|ИЗ
			|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
			|		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка = &Ссылка
			|		И торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID
			|ИЗ
			|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
			|ГДЕ
			|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка = &Ссылка");
		Иначе
			Запрос = Новый Запрос(СтрЗаменить(
			"ВЫБРАТЬ
			|	Таб.ID КАК ID
			|ИЗ
			|	&Таб КАК Таб
			|ГДЕ
			|	Таб.Ссылка = &Ссылка",
			"&Таб",
			СтрШаблон("Документ.%1.РемонтыОборудования", Регистратор.Метаданные().Имя)));
		КонецЕсли;
		Запрос.УстановитьПараметр("Ссылка", Регистратор);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			УстановитьВручнуюСтатусДляРемонтаВЗаявке(Ссылка, Результат.Выгрузить().ВыгрузитьКолонку("ID"), Статус, ТекущаяДатаСеанса(),,, Ложь, Регистратор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Изменить статусы документов оснований.
// Процедура предназначена для изменения статусов документов оснований проводимого документа.
//
// Параметры:
//  Регистратор - 	ДокументСсылка.торо_ЗаявкаНаРемонт, 
//							ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//							ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия,
//							ДокументСсылка.торо_АктОВыполненииЭтапаРабот,
//							ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов - Ссылка на документ меняющий статус своих документов оснований.
Процедура ИзменитьСтатусыДокументовОснований(Регистратор) Экспорт
	
	ДокументыОснования = Новый ТаблицаЗначений;
	
	МассивТиповОснований = Новый Массив;
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
	
	ДокументыОснования.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(МассивТиповОснований));
	
	ПолучитьДокументыОснования(Регистратор, ДокументыОснования);
	
	СтруктураДокОснований = Новый Структура;
	Для каждого Стр Из ДокументыОснования Цикл
		
		СтруктураДокОснований.Вставить("Атрибут" + Строка(ДокументыОснования.Индекс(Стр)), Стр.ДокументОснование);
		
	КонецЦикла;
	
	ТаблицаУстанавливаемыхСтатусов = ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке(Регистратор, СтруктураДокОснований);
	ТаблицаПорядкаСтатусов = торо_РаботаСоСтатусамиДокументовПовтИсп.ПолучитьТаблицуПорядкаСтатусовДокументов(СтруктураДокОснований);
	
	ИменаИспользующихсяРегистров = ПолучитьМассивИменИспользующихсяРегистров(Регистратор, ДокументыОснования);
	
	Если ИменаИспользующихсяРегистров.Количество() Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДокументыОснования.ДокументОснование
		|ПОМЕСТИТЬ ДокументыОснования
		|ИЗ
		|	&ДокументыОснования КАК ДокументыОснования
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУстанавливаемыхСтатусов.ТипДокумента,
		|	ТаблицаУстанавливаемыхСтатусов.УстанавливаемыйСтатус,
		|	ТаблицаУстанавливаемыхСтатусов.Порядок
		|ПОМЕСТИТЬ ТаблицаУстанавливаемыхСтатусов
		|ИЗ
		|	&ТаблицаУстанавливаемыхСтатусов КАК ТаблицаУстанавливаемыхСтатусов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПорядкаСтатусов.ТипДокумента,
		|	ТаблицаПорядкаСтатусов.Статус,
		|	ТаблицаПорядкаСтатусов.Порядок
		|ПОМЕСТИТЬ ТаблицаПорядкаСтатусов
		|ИЗ
		|	&ТаблицаПорядкаСтатусов КАК ТаблицаПорядкаСтатусов
		|ИНДЕКСИРОВАТЬ ПО
		|	Статус,
		|	ТипДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|%ОбъединениеРегистровИОснований%
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыОснованияСРегистрами.ИзменяемыйДокумент,
		|	МАКСИМУМ(ТаблицаПорядкаСтатусов.Порядок) КАК Порядок
		|ПОМЕСТИТЬ ИмеющиесяСтатусыИПриоритеты
		|ИЗ
		|	ДокументыОснованияСРегистрами КАК ДокументыОснованияСРегистрами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПорядкаСтатусов КАК ТаблицаПорядкаСтатусов
		|		ПО ДокументыОснованияСРегистрами.СтатусДокумента = ТаблицаПорядкаСтатусов.Статус
		|			И ТИПЗНАЧЕНИЯ(ДокументыОснованияСРегистрами.ИзменяемыйДокумент) = ТИПЗНАЧЕНИЯ(ТаблицаПорядкаСтатусов.ТипДокумента)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыОснованияСРегистрами.ИзменяемыйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИмеющиесяСтатусыИПриоритеты.ИзменяемыйДокумент,
		|	ТаблицаУстанавливаемыхСтатусов.УстанавливаемыйСтатус,
		|	ИСТИНА КАК СтатусУстановлен
		|ИЗ
		|	ИмеющиесяСтатусыИПриоритеты КАК ИмеющиесяСтатусыИПриоритеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаУстанавливаемыхСтатусов КАК ТаблицаУстанавливаемыхСтатусов
		|		ПО ТИПЗНАЧЕНИЯ(ИмеющиесяСтатусыИПриоритеты.ИзменяемыйДокумент) = ТИПЗНАЧЕНИЯ(ТаблицаУстанавливаемыхСтатусов.ТипДокумента)
		|			И ИмеющиесяСтатусыИПриоритеты.Порядок < ТаблицаУстанавливаемыхСтатусов.Порядок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИмеющиесяСтатусыИПриоритеты.ИзменяемыйДокумент,
		|	ТаблицаУстанавливаемыхСтатусов.УстанавливаемыйСтатус,
		|	ЛОЖЬ
		|ИЗ
		|	ИмеющиесяСтатусыИПриоритеты КАК ИмеющиесяСтатусыИПриоритеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаУстанавливаемыхСтатусов КАК ТаблицаУстанавливаемыхСтатусов
		|		ПО ТИПЗНАЧЕНИЯ(ИмеющиесяСтатусыИПриоритеты.ИзменяемыйДокумент) = ТИПЗНАЧЕНИЯ(ТаблицаУстанавливаемыхСтатусов.ТипДокумента)
		|			И ИмеющиесяСтатусыИПриоритеты.Порядок >= ТаблицаУстанавливаемыхСтатусов.Порядок";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ОбъединениеРегистровИОснований%", 
		ОбъединениеРегистровИОснований(ИменаИспользующихсяРегистров));
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТаблицаПорядкаСтатусов", 		ТаблицаПорядкаСтатусов);
		Запрос.УстановитьПараметр("ТаблицаУстанавливаемыхСтатусов", ТаблицаУстанавливаемыхСтатусов);
		Запрос.УстановитьПараметр("ДокументыОснования",				ДокументыОснования);
		Запрос.УстановитьПараметр("Регистратор", 					Регистратор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Движения = Регистратор.ПолучитьОбъект().Движения;
		
		Пока Выборка.Следующий() Цикл
			УстановитьСтатусДокумента(Выборка.ИзменяемыйДокумент, Регистратор, Движения, Выборка.УстанавливаемыйСтатус, Выборка.СтатусУстановлен);
		КонецЦикла;
		
		ЗаписатьДвиженияРегистратора(Движения, ИменаИспользующихсяРегистров);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить статус в заголовок формы
//
// Параметры:
//  Заголовок - Строка - Заголовок формы.
//  Форма - УправляемаяФорма - Форма которой в заголовок следует добавить статус документа.
//
// Возвращаемое значение:
//  Строка - заголовок формы.
Функция ДобавитьСтатусВЗаголовокФормы(Заголовок, Форма) Экспорт
	
	Ссылка = Форма.Объект.Ссылка;
		
	ТекущийСтатусДокумента = ПолучитьТекущийСтатусДокумента(Ссылка);
	
	Если ТекущийСтатусДокумента <> Неопределено Тогда
		Возврат Заголовок + " [" + Строка(ТекущийСтатусДокумента) + "]";
	Иначе
		Возврат Заголовок;
	КонецЕсли;
			
КонецФункции

// Процедура - Отмена проведения.
//	Необходимо вызывать при обработке удаления проведения для изменения реквизита СтатусУстановлен других записей,
//	что позволит определить текущий статус документа без лишних трудностей.
//
// Параметры:
//  Регистратор			 - 	ДокументСсылка.торо_ЗаявкаНаРемонт, 
//							ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//							ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия,
//							ДокументСсылка.торо_АктОВыполненииЭтапаРабот,
//							ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов - Ссылка на документ удаляющий свои движения. 
Процедура ОтменаПроведения(Регистратор) Экспорт
	
	// ФСВ
	ДокументыОснования = Новый ТаблицаЗначений;
	
	МассивТиповОснований = Новый Массив;
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
	
	ДокументыОснования.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(МассивТиповОснований));
	
	ПолучитьДокументыОснования(Регистратор, ДокументыОснования);
	
	СтруктураДокОснований = Новый Структура;
	Для каждого Стр Из ДокументыОснования Цикл
		
		СтруктураДокОснований.Вставить("Атрибут" + Строка(ДокументыОснования.Индекс(Стр)), Стр.ДокументОснование);
		
	КонецЦикла;
	// ФСВ
	
	МассивИменИспользующихсяРегистров = ПолучитьМассивИменИспользующихсяРегистров(Регистратор, ДокументыОснования);
	
	Если МассивИменИспользующихсяРегистров.Количество() Тогда
		ТекстЗапроса = "";
		
		// Формируем текст запроса для получения всех записей регистратора по регистрам со статусами.
		ДобавитьОбъединитьВсе = Ложь;
		Для Каждого ИмяРегистра Из МассивИменИспользующихсяРегистров Цикл
			ТекстЗапроса = ТекстЗапроса 
			+ ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, Ложь,,, Истина, 
			?(ДобавитьОбъединитьВсе, "", "ЗаписиПоРегистратору")) + Символы.ПС;
			ДобавитьОбъединитьВсе = Истина;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса 
		+ ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		// Формируем текст запроса для получения записей по всем документам статусы которых поменял регистратор.
		ВВиртТабл = Истина;
		Первый = Истина;
		Для Каждого ИмяРегистра Из МассивИменИспользующихсяРегистров Цикл
			ТекстЗапроса = ТекстЗапроса + ПолучитьТекстЗапросаТаблицыДокументовДляУстановкиФлагаПриОтменеПроведения(ИмяРегистра, Первый, ?(ВВиртТабл, "ИмеющиесяДругиеЗаписи", ""));
			ВВиртТабл = Ложь;
			Первый = Ложь;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПорядкаСтатусов.ТипДокумента,
		|	ТаблицаПорядкаСтатусов.Статус,
		|	ТаблицаПорядкаСтатусов.Порядок
		|ПОМЕСТИТЬ ТаблицаПорядкаСтатусов
		|ИЗ
		|	&ТаблицаПорядкаСтатусов КАК ТаблицаПорядкаСтатусов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИмеющиесяДругиеЗаписи.Регистратор,
		|	ИмеющиесяДругиеЗаписи.Период,
		|	ТаблицаПорядкаСтатусов.Статус,
		|	ТаблицаПорядкаСтатусов.Порядок,
		|	ИмеющиесяДругиеЗаписи.ИзменяемыйДокумент
		|ПОМЕСТИТЬ ИмеющиесяДругиеЗаписиСПорядком
		|ИЗ
		|	ТаблицаПорядкаСтатусов КАК ТаблицаПорядкаСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмеющиесяДругиеЗаписи КАК ИмеющиесяДругиеЗаписи
		|		ПО (ТИПЗНАЧЕНИЯ(ТаблицаПорядкаСтатусов.ТипДокумента) = ТИПЗНАЧЕНИЯ(ИмеющиесяДругиеЗаписи.ИзменяемыйДокумент))
		|			И ТаблицаПорядкаСтатусов.Статус = ИмеющиесяДругиеЗаписи.СтатусДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИмеющиесяДругиеЗаписиСПорядком.ИзменяемыйДокумент,
		|	МАКСИМУМ(ИмеющиесяДругиеЗаписиСПорядком.Порядок) КАК Порядок
		|ПОМЕСТИТЬ ДокументСМаксимальнымНовымСтатусом
		|ИЗ
		|	ИмеющиесяДругиеЗаписиСПорядком КАК ИмеющиесяДругиеЗаписиСПорядком
		|
		|СГРУППИРОВАТЬ ПО
		|	ИмеющиесяДругиеЗаписиСПорядком.ИзменяемыйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументСМаксимальнымНовымСтатусом.ИзменяемыйДокумент,
		|	ДокументСМаксимальнымНовымСтатусом.Порядок,
		|	ИмеющиесяДругиеЗаписиСПорядком.Период,
		|	ИмеющиесяДругиеЗаписиСПорядком.Регистратор
		|ПОМЕСТИТЬ МаксимальныеСтатусы
		|ИЗ
		|	ДокументСМаксимальнымНовымСтатусом КАК ДокументСМаксимальнымНовымСтатусом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмеющиесяДругиеЗаписиСПорядком КАК ИмеющиесяДругиеЗаписиСПорядком
		|		ПО ДокументСМаксимальнымНовымСтатусом.ИзменяемыйДокумент = ИмеющиесяДругиеЗаписиСПорядком.ИзменяемыйДокумент
		|			И ДокументСМаксимальнымНовымСтатусом.Порядок = ИмеющиесяДругиеЗаписиСПорядком.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеСтатусы.ИзменяемыйДокумент КАК ИзменяемыйДокумент,
		|	МаксимальныеСтатусы.Регистратор КАК Регистратор
		|ИЗ
		|	МаксимальныеСтатусы КАК МаксимальныеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МаксимальныеСтатусы.ИзменяемыйДокумент КАК ИзменяемыйДокумент,
		|			МИНИМУМ(МаксимальныеСтатусы.Период) КАК Период
		|		ИЗ
		|			МаксимальныеСтатусы КАК МаксимальныеСтатусы
		|		
		|		СГРУППИРОВАТЬ ПО
		|			МаксимальныеСтатусы.ИзменяемыйДокумент) КАК ВложенныйЗапрос
		|		ПО МаксимальныеСтатусы.ИзменяемыйДокумент = ВложенныйЗапрос.ИзменяемыйДокумент
		|			И МаксимальныеСтатусы.Период = ВложенныйЗапрос.Период
		|ИТОГИ ПО
		|	Регистратор,
		|	ИзменяемыйДокумент";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("ТаблицаПорядкаСтатусов", торо_РаботаСоСтатусамиДокументовПовтИсп.ПолучитьТаблицуПорядкаСтатусовДокументов(СтруктураДокОснований));
		ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегистратор.Следующий() Цикл
			ДокументОбъект = ВыборкаРегистратор.Регистратор.ПолучитьОбъект();
			ВыборкаДокумент = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Движения = ДокументОбъект.Движения;
			
			МассивИменИспользующихсяРегистров = ПолучитьМассивИменИспользующихсяРегистров(ВыборкаРегистратор.Регистратор, ДокументыОснования);
			
			Для Каждого ИмяРегистра Из МассивИменИспользующихсяРегистров Цикл
				Выполнить("ДокументОбъект.Движения." + ИмяРегистра + ".Записывать = Истина");
				Выполнить("ДокументОбъект.Движения." + ИмяРегистра + ".Прочитать()");
			КонецЦикла;
			
			Пока ВыборкаДокумент.Следующий() Цикл
				ИмяРегистра = ПолучитьИмяРегистраПоСсылке(ВыборкаДокумент.ИзменяемыйДокумент);
				
				УстановленноеДвижение = Неопределено;
				
				Для Каждого Движение Из Вычислить("Движения." + ИмяРегистра) Цикл
					Если Движение.ИзменяемыйДокумент = ВыборкаДокумент.ИзменяемыйДокумент Тогда
						Движение.СтатусУстановлен = Истина;
						УстановленноеДвижение = Движение;
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей = Вычислить("Движения." + ИмяРегистра + "Установленные");
				УжеЕсть = Ложь;
				Для каждого Запись из НаборЗаписей Цикл
					Если Запись.ИзменяемыйДокумент = ВыборкаДокумент.ИзменяемыйДокумент Тогда
						УжеЕсть = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ УжеЕсть И УстановленноеДвижение <> Неопределено Тогда
					ЗаписьНовая = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьНовая, УстановленноеДвижение);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ИмяРегистра Из МассивИменИспользующихсяРегистров Цикл
				Выполнить("ДокументОбъект.Движения." + ИмяРегистра + ".Записать()");
				Выполнить("ДокументОбъект.Движения." + ИмяРегистра + "Установленные.Записать()");
			КонецЦикла;
		КонецЦикла;
		
		ОткатСтатусаРемонтаВЗаявкеПриОтменеПроведения(Регистратор);
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		
		НЗ = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
		НЗ.Отбор.ЗаявкаНаРемонт.Установить(Регистратор);
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить текущий статус документа
//
// Параметры:
//  Ссылка	 -	ДокументСсылка.торо_ВыявленныеДефекты,
//				ДокументСсылка.торо_ВнешнееОснованиеДляРабот,
//				ДокументСсылка.торо_ЗаявкаНаРемонт, 
//				ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//				ДокументСсылка.торо_НарядНаРегламентноеМероприятие - Ссылка на документ для которого требуется получить статус.
// Возвращаемое значение:
//  ПеречислениеСсылка.торо_СтатусыДокументов, Неопределено - Текущий статус документа, 
//      либо Неопределено если получить не удалось.
Функция ПолучитьТекущийСтатусДокумента(Ссылка) Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраПоСсылке(Ссылка);
	
	Если ИмяРегистра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ТекстЗапроса = ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра,,,,,,Ложь); 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусДокумента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить имя регистра по ссылке. Сделана экспортной для использования при обновлении информационной базы.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.торо_ВыявленныеДефекты,
//				ДокументСсылка.торо_ВнешнееОснованиеДляРабот,
//				ДокументСсылка.торо_ЗаявкаНаРемонт, 
//				ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот,
//				ДокументСсылка.торо_НарядНаРегламентноеМероприятие - Ссылка на документ по которой требуется получить
//																	имя регистра для изменения статуса документа.
// Возвращаемое значение:
//  Строка - Имя регистра.
Функция ПолучитьИмяРегистраПоСсылке(Ссылка) Экспорт
	
	ИмяРегистра = Неопределено;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		ИмяРегистра = "торо_СтатусыДокументовВыявленныхДефектов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		ИмяРегистра = "торо_СтатусыДокументовЗаявок";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		ИмяРегистра = "торо_СтатусыДокументовВнешнихОснований";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		ИмяРегистра = "торо_СтатусыДокументовНарядовНаРемонтныеРаботы";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
		ИмяРегистра = "торо_СтатусыДокументовНарядовНаМероприятия";
	КонецЕсли;
	
	Возврат ИмяРегистра;
	
КонецФункции

// Функция - Установить вручную статус для ремонта в заявке
//
// Параметры:
//  ЗаявкаСсылка					 - ДокументСсылка.торо_ЗаявкаНаРемонт - Ссылка на заявку, по которой устанавливается статус
//  ИДРемонта						 - Строка, Массив - Идентификатор(ы) ремонта, для которого устанавливается статус
//  Статус							 - Перечисление.торо_СтатусыДокументов - Устанавливаемый статус
//  ВремяУстановки					 - Дата - Время, когда статус был установлен
//  Пользователь					 - СправочникСсылка.Пользователи - Устанавливающий статус пользователь
//  КомментарийКСтатусу				 - Строка - Описание причины, по которой статус был установлен, доп. информация
//  ПерезаписыватьСтандартныеСтатусы - Булево - Отключить изменение статусов заявки (например, для акта)
//  Регистратор					 	 - ДокументСсылка - Устанавливающий статус документ
// 
// Возвращаемое значение:
//  Массив - Массив структур с полями вида: ИДРемонта, Успешно, СтатусУстановлен, ОписаниеРезультатаТекст
//
Функция УстановитьВручнуюСтатусДляРемонтаВЗаявке(Знач ЗаявкаСсылка, Знач ИДРемонта, Знач Статус, Знач ВремяУстановки = Неопределено, Знач КомментарийКСтатусу = "", Знач Пользователь = Неопределено, ПерезаписыватьСтандартныеСтатусы = Истина, Регистратор = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ТипЗнч(ИДРемонта) = Тип("Массив") Тогда
		МассивИДРемонта = Новый Массив(1);
		МассивИДРемонта[0] = ИДРемонта;
	Иначе
		МассивИДРемонта = ИДРемонта;
	КонецЕсли;
	
	Если ВремяУстановки = Неопределено Тогда
		ВремяУстановки = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаСсылка, "Дата");
	
	МассивРезультатовПоРемонтам = Новый Массив;
	НачатьТранзакцию();
	
	Блокировки = Новый БлокировкаДанных;
	
	Блк = Блокировки.Добавить("РегистрСведений.торо_СтатусыРемонтовВЗаявках");
	Блк.Режим = РежимБлокировкиДанных.Исключительный;
	Блк.УстановитьЗначение("ЗаявкаНаРемонт", ЗаявкаСсылка);
	
	Блокировки.Заблокировать();
	
	ТекДанныеСтатусов = ТекДанныеСтатусовРемонтовЗаявки(ЗаявкаСсылка);
	
	флЗаписывать = Ложь;
	
	НЗСтатусыВЗаявках = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
	НЗСтатусыВЗаявках.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаСсылка);
	НЗСтатусыВЗаявках.Прочитать();
	
	сзУдаляемыеЗаписи = Новый СписокЗначений;
	Для Каждого Запись Из НЗСтатусыВЗаявках Цикл
	    Если Запись.ДокументИсточник = Регистратор Тогда
	        сзУдаляемыеЗаписи.Добавить(Запись);
	    КонецЕсли; 
	КонецЦикла;

	Для каждого ЭлтСз Из сзУдаляемыеЗаписи Цикл
	    НЗСтатусыВЗаявках.Удалить(ЭлтСз.Значение);
	КонецЦикла;

	Для Каждого ИДРемонта Из МассивИДРемонта Цикл
		РезультатОбработкиРемонта = Новый Структура("ИДРемонта, Успешно, СтатусУстановлен, ОписаниеРезультатаТекст",ИДРемонта, Истина, Ложь, "");
		ПоменятьСтатусНаВыполнен = РемонтЗавершен(ИДРемонта, Регистратор);
		
		УстанавливаемыйСтатус = Статус;
		Если ПоменятьСтатусНаВыполнен Тогда
			УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		КонецЕсли;
		
		РезультатПроверки = МожноУстановитьСтатусДляРемонтаВЗаявке(ТекДанныеСтатусов, ИДРемонта, УстанавливаемыйСтатус, Регистратор);
		Если РезультатПроверки.Возможно Тогда
		
			флЗаписывать = Истина;
			
			Запись = НЗСтатусыВЗаявках.Добавить();
			Запись.ЗаявкаНаРемонт = ЗаявкаСсылка;
			Запись.ИДРемонта = ИДРемонта;
			Запись.Период = ВремяУстановки;
			Запись.Статус = УстанавливаемыйСтатус;
			Запись.КомментарийКСтатусу = КомментарийКСтатусу;
			Запись.Пользователь = Пользователь;
			Запись.ДокументИсточник = Регистратор;
			
			РезультатОбработкиРемонта.СтатусУстановлен = Истина;
			
		Иначе
			// Формируем описание причины, почему не был установлен статус, в некоторых случаям устанавливаем Успешно в Ложь
			Если РезультатПроверки.Причина = "УжеУстановлен" Тогда
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Статус %1 уже установлен!'"), УстанавливаемыйСтатус);
			ИначеЕсли РезультатПроверки.Причина = "СтатусЗаявкиНеУстановлен" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Для заявки не установлен никакой статус, заявка не проведена!'");
			ИначеЕсли РезультатПроверки.Причина = "РемонтОтсутствуетВЗаявке" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Ремонт отсутствует в заявке!'");
			ИначеЕсли РезультатПроверки.Причина = "УстановленБолееПриоритетный" Тогда
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Более приоритетный статус %1 уже установлен!'"), РезультатПроверки.ТекСтатусРемонта);
			Иначе
				РезультатОбработкиРемонта.Успешно = Ложь;
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = РезультатПроверки.Причина;
			КонецЕсли;
			
		КонецЕсли;
		МассивРезультатовПоРемонтам.Добавить(РезультатОбработкиРемонта);
	КонецЦикла;
	
	Если флЗаписывать Тогда
		НЗСтатусыВЗаявках.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
	Возврат МассивРезультатовПоРемонтам;
	
КонецФункции

// Процедура - Установить статус заявки и ремонтов при проведении заявки
//
// Параметры:
//  Источник - ДокументСсылка.торо_ЗаявкаНаРемонт, ДокументСсылка.торо_АктОВыполненииЭтапаРабот,
//		ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот, ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов - 
//			Документ при отмене проведения которого может поменяться статус ремонта в заявке
//
Процедура УстановитьСтатусРемонтовПриПроведенииЗаявки(Источник) Экспорт
	
	ЗаявкаСсылка = Источник.Ссылка;
	Статус = Перечисления.торо_СтатусыДокументов.Зарегистрирован;
	ВремяУстановки = Источник.Дата;
	
	МассивИДРемонта = Новый Массив;
	Для Каждого РемонтОборудования Из Источник.РемонтыОборудования Цикл
		МассивИДРемонта.Добавить(РемонтОборудования.ID);
	КонецЦикла;
	
	Блокировки = Новый БлокировкаДанных;
	
	Блк = Блокировки.Добавить("РегистрСведений.торо_СтатусыРемонтовВЗаявках");
	Блк.Режим = РежимБлокировкиДанных.Исключительный;
	Блк.УстановитьЗначение("ЗаявкаНаРемонт", ЗаявкаСсылка);
	
	Блокировки.Заблокировать();
	
	ТекДанныеСтатусов = Неопределено;
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ТекДанныеСтатусов", ТекДанныеСтатусов) Тогда
		ПустойСтатус = Перечисления.торо_СтатусыДокументов.ПустаяСсылка();
		ТекДанныеСтатусов = Новый Структура("Общий, Ремонты", ПустойСтатус, Новый Соответствие);
		Для Каждого РемонтОборудования Из Источник.РемонтыОборудования Цикл
			ТекДанныеСтатусов.Ремонты.Вставить(РемонтОборудования.ID, Новый Структура ("Комментарий, Статус", "", ПустойСтатус));
		КонецЦикла;
	КонецЕсли;
	
	флЗаписывать = Ложь;
		
	НЗСтатусыВЗаявках = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
	НЗСтатусыВЗаявках.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаСсылка);
	НЗСтатусыВЗаявках.Прочитать();
	НЗСтатусыВЗаявках.Очистить();
	
	Для Каждого ИДРемонта Из МассивИДРемонта Цикл
		
		РезультатПроверки = МожноУстановитьСтатусДляРемонтаВЗаявке(ТекДанныеСтатусов, ИДРемонта, Статус);
			
		Если РезультатПроверки.Возможно Тогда
			
			флЗаписывать = Истина;
			
			Если НЕ РезультатПроверки.ТекСтатусРемонта = Перечисления.торо_СтатусыДокументов.ПустаяСсылка() Тогда 
				ТекСтатусРемонта = РезультатПроверки.ТекСтатусРемонта;
			КонецЕсли;
							
			Запись = НЗСтатусыВЗаявках.Добавить();
			Запись.ЗаявкаНаРемонт = ЗаявкаСсылка;
			Запись.ИДРемонта = ИДРемонта;
			Запись.Период = ВремяУстановки;
			Запись.Статус = ?(ЗначениеЗаполнено(ТекСтатусРемонта), ТекСтатусРемонта, Статус);
			Запись.ДокументИсточник = Источник.Ссылка;
						
		КонецЕсли;
		
	КонецЦикла;
	
	Если флЗаписывать Тогда
		НЗСтатусыВЗаявках.Записать();
	КонецЕсли;

КонецПроцедуры

// Функция - Тек данные статусов ремонтов заявки
//
// Параметры:
//  ЗаявкаСсылка - ДокументСсылка.торо_ЗаявкаНаРемонт - Заявка статусы ремонтов которой нужно получить
// 
// Возвращаемое значение:
//  Структура - Общий: общий статус заявки; Ремонты: Соответствие( ИДРемонта:Статус и комментарий к статусу)
//
Функция ТекДанныеСтатусовРемонтовЗаявки(ЗаявкаСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура("Общий, Ремонты", Перечисления.торо_СтатусыДокументов.ПустаяСсылка(), Новый Соответствие);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
	|ПОМЕСТИТЬ РемонтыЗаявки
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = &ЗаявкаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних(, ИзменяемыйДокумент = &ЗаявкаСсылка) КАК торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус, &ПустойСтатус) КАК Статус,
	|	ЕСТЬNULL(торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу, &ПустойКомментарий) КАК Комментарий,
	|	ЕСТЬNULL(торо_СтатусыРемонтовВЗаявкахСрезПоследних.ДокументИсточник, ЗНАЧЕНИЕ(Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка)) КАК Источник,
	|	РемонтыЗаявки.ID КАК ИДРемонта
	|ИЗ
	|	РемонтыЗаявки КАК РемонтыЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(, ЗаявкаНаРемонт = &ЗаявкаСсылка) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	|		ПО РемонтыЗаявки.ID = торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта");
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.торо_СтатусыДокументов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКомментарий", "");
	
	Результаты = Запрос.ВыполнитьПакет();
	РезСтатусОбщий = Результаты[1];
	РезСтатусыПоРемонтам = Результаты[2];
	
	Если РезСтатусОбщий.Пустой() Тогда
		СтруктураВозврата.Вставить("Ошибка", "СтатусЗаявкиНеУстановлен");
	КонецЕсли;
	
	ВыборкаТекСтатусОбщий = РезСтатусОбщий.Выбрать(); 
	Если ВыборкаТекСтатусОбщий.Следующий() Тогда
		СтруктураВозврата.Общий = ВыборкаТекСтатусОбщий.СтатусДокумента;
	КонецЕсли;
	
	ВыборкаСтатусовРемонтов = РезСтатусыПоРемонтам.Выбрать();
	Пока ВыборкаСтатусовРемонтов.Следующий() Цикл
		СтатусИКомментарий = Новый Структура("Статус, Комментарий, Источник");
		ЗаполнитьЗначенияСвойств(СтатусИКомментарий, ВыборкаСтатусовРемонтов);
		СтруктураВозврата.Ремонты.Вставить(ВыборкаСтатусовРемонтов.ИДРемонта, СтатусИКомментарий);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Подробные данные о статусе ремонта в заявке
//
// Параметры:
//  ЗаявкаСсылка - ДокументСсылка.торо_ЗаявкаНаРемонт - Заявка, запись о ремонте которой нужно получить;
//  ИДРемонта - Строка - Идентификатор ремонта
// 
// Возвращаемое значение:
//  Структура - Статус: статус ремонта; Комментарий: комментарий к установке статуса; Период: время установки статуса
//
Функция ПолучитьПодробнуюИнформациюОСтатусеРемонта(ЗаявкаСсылка, ИДРемонта) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус,
	               |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу КАК Комментарий,
	               |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
	               |			,
	               |			ЗаявкаНаРемонт = &ЗаявкаСсылка
	               |				И ИДРемонта = &ИДРемонта) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("ИДРемонта", ИДРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура("Статус,Комментарий,Период");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Функция - Обработка события из мобильного приложения
//
// Параметры:
//  ДатаВремяСобытия	 - Дата - Дата и время события как оно было записано в МП
//  ИнформацияСобытия	 - Структура - Структура со свойствами:
//		ГУИДЗаявки - Идентификатор заявки (из ссылки)
//		ИДРемонта - Идентификатор конкретного ремонта
//		Статус - Был установлен статус
//		Комментарий - Примечание при установке статуса
//  ТипСобытия			 - Строка - Имя события
// 
// Возвращаемое значение:
//  Структура - ИДРемонта, Успешно, СтатусУстановлен, ОписаниеРезультатаТекст
//
Функция ОбработкаСобытияИзМобильногоПриложения(ДатаВремяСобытия, ИнформацияСобытия, ТипСобытия) Экспорт
	
	ЗаявкаСсылка = Документы.торо_ЗаявкаНаРемонт.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ИнформацияСобытия.ГУИДЗаявки)
	);
	
	МассивРезультатовПоИД = УстановитьВручнуюСтатусДляРемонтаВЗаявке(
		ЗаявкаСсылка,
		ИнформацияСобытия.ИДРемонта,
		Перечисления.торо_СтатусыДокументов[ИнформацияСобытия.Статус],
		ДатаВремяСобытия,
		ИнформацияСобытия.Комментарий
	);
	// В этой функции будет всегда массив с одним элементом поскольку в информации события только один ИД ремонта
	Возврат МассивРезультатовПоИД[0];
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткатСтатусаРемонтаВЗаявкеПриОтменеПроведения(ИсточникСсылка)
	
	Если ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		НаборЗаписей = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(ИсточникСсылка);
		НаборЗаписей.Записать(Истина);
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") ИЛИ ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") 
		ИЛИ ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		Если ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
			ТекстДляВТ = 
			"ВЫБРАТЬ
			|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка КАК Заявка
			|ПОМЕСТИТЬ Заявки
			|ИЗ
			|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
			|ГДЕ
			|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
			|ИЗ
			|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
			|		ПО (торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка = &Ссылка)
			|			И торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID; ";
			
		ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда 
			ТекстДляВТ = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Заявка
			|ПОМЕСТИТЬ Заявки
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
			|		ПО (торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка = &Ссылка)
			|			И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID; ";
		
		Иначе
			ТекстДляВТ = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Заявка
			|ПОМЕСТИТЬ Заявки
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
			|		ПО (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Ссылка)
			|			И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID; ";
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДляВТ);
		Запрос.Текст = Запрос.Текст 
		+ "ВЫБРАТЬ
		  |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК СтатусДокумента,
		  |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК Документ
		  |ИЗ
		  |	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
		  |			,
		  |			ЗаявкаНаРемонт В
		  |				(ВЫБРАТЬ
		  |					Заявки.Заявка
		  |				ИЗ
		  |					Заявки)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
		  |ГДЕ
		  |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ДокументИсточник = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			ТекДата = ТекущаяДатаСеанса();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтатусОтменяемый = Выборка.СтатусДокумента;
				НаборЗаписей = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(Выборка.Документ);
				НаборЗаписей.Прочитать();				
				ДанныеКДобавлению = Новый Массив;
				
				Для каждого Запись Из НаборЗаписей Цикл
					Если НЕ Запись.ДокументИсточник = ИсточникСсылка Тогда
						СтруктураДобавления = Новый Структура("Период, Статус, ИДРемонта, ЗаявкаНаРемонт, КомментарийКСтатусу, Пользователь, ДокументИсточник");
						ЗаполнитьЗначенияСвойств(СтруктураДобавления, Запись);
						ДанныеКДобавлению.Добавить(СтруктураДобавления);
					КонецЕсли; 
				КонецЦикла; 
				
				НаборЗаписей.Очистить();
				
				Для Каждого ДляДобавления Из ДанныеКДобавлению Цикл
					ЗаписьСНовымСтатусом = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьСНовымСтатусом, ДляДобавления);
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция МожноУстановитьСтатусДляРемонтаВЗаявке(ТекДанныеСтатусов, ИДРемонта, Статус, Источник = Неопределено)
	
	пСтатусы = Перечисления.торо_СтатусыДокументов;
	ПустойСтатус = пСтатусы.ПустаяСсылка();
	
	СтруктураВозврата = Новый Структура("Возможно, ДляВсейЗаявки, Причина, ТекСтатусОбщий, ТекСтатусРемонта", Ложь, Ложь, "", ПустойСтатус, ПустойСтатус);
	
	Если ТекДанныеСтатусов.Свойство("Ошибка") Тогда
		СтруктураВозврата.Причина = ТекДанныеСтатусов.Ошибка;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтатусыРемонтов = ТекДанныеСтатусов.Ремонты;
				
	Если СтатусыРемонтов.Получить(ИДРемонта) = Неопределено Тогда
		
		СтруктураВозврата.ТекСтатусРемонта = ПустойСтатус;
		СтруктураВозврата.Причина = "РемонтОтсутствуетВЗаявке";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	СтруктураВозврата.ТекСтатусРемонта = СтатусыРемонтов.Получить(ИДРемонта).Статус;
	
	ДокИсточник = "";
	Если СтатусыРемонтов.Получить(ИДРемонта).Свойство("Источник") Тогда
		ДокИсточник = СтатусыРемонтов.Получить(ИДРемонта).Источник;
	КонецЕсли; 
	
	Если СтруктураВозврата.ТекСтатусРемонта = Статус и ДокИсточник <> Источник Тогда
		СтруктураВозврата.Причина = "УжеУстановлен";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	БлокирующиеСтатусы = БлокирующиеСменуСтатусаРемонтаВЗаявкеСтатусы(Статус);
	Если БлокирующиеСтатусы.Найти(СтруктураВозврата.ТекСтатусРемонта) <> Неопределено Тогда
		
		СтруктураВозврата.Причина = "УстановленБолееПриоритетный";
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	// Если дошли до сюда - то статус ремонта поменять можем
	СтруктураВозврата.Возможно = Истина;
	
	СтатусыРемонтов.Вставить(ИДРемонта, Статус);
	Если Статус = пСтатусы.ОтказИсполнителя Тогда
		
		Для Каждого КлючЗначение Из СтатусыРемонтов Цикл
			Если КлючЗначение.Значение <> Статус Тогда
				СтруктураВозврата.Причина = "ДолженБытьУстановленВыполняется";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция РемонтЗавершен(ИДРемонта, Регистратор)
	
	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаРемонта = Регистратор.РемонтыОборудования.Найти(ИДРемонта, "ID");
	Если СтрокаРемонта <> Неопределено И СтрокаРемонта.ЗавершитьРемонт Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция БлокирующиеСменуСтатусаРемонтаВЗаявкеСтатусы(Статус)
	
	// TODO: Пересмотреть граф статусов
	
	МассивСтатусов = Новый Массив;
	Статусы = Перечисления.торо_СтатусыДокументов;
	
	Если Статус = Статусы.Выполняется Тогда
		МассивСтатусов.Добавить(Статусы.Выполнен);
		МассивСтатусов.Добавить(Статусы.Отклонен);
		МассивСтатусов.Добавить(Статусы.Устранен);
	ИначеЕсли Статус = Статусы.ОтказИсполнителя Тогда
		МассивСтатусов.Добавить(Статусы.Выполнен);
		МассивСтатусов.Добавить(Статусы.Отклонен);
		МассивСтатусов.Добавить(Статусы.Устранен);
		МассивСтатусов.Добавить(Статусы.Выполняется);
	ИначеЕсли Статус = Статусы.ОтказПодразделения Тогда
		МассивСтатусов.Добавить(Статусы.Выполнен);
		МассивСтатусов.Добавить(Статусы.Отклонен);
		МассивСтатусов.Добавить(Статусы.Устранен);
		МассивСтатусов.Добавить(Статусы.Выполняется);
	ИначеЕсли Статус = Статусы.Зарегистрирован Тогда
		МассивСтатусов.Добавить(Статусы.Выполнен);
		МассивСтатусов.Добавить(Статусы.Отклонен);
		МассивСтатусов.Добавить(Статусы.Устранен);
		МассивСтатусов.Добавить(Статусы.Выполняется);
		МассивСтатусов.Добавить(Статусы.ОтказПодразделения);
		МассивСтатусов.Добавить(Статусы.ОтказИсполнителя);
		МассивСтатусов.Добавить(Статусы.ВозобновленоПослеОтказа);
	ИначеЕсли Статус = Статусы.ВозобновленоПослеОтказа Тогда
		МассивСтатусов.Добавить(Статусы.Выполнен);
		МассивСтатусов.Добавить(Статусы.Отклонен);
		МассивСтатусов.Добавить(Статусы.Устранен);
		МассивСтатусов.Добавить(Статусы.Выполняется);
	КонецЕсли;
	
	Возврат МассивСтатусов;
	
КонецФункции

Функция ПолучитьМассивИменИспользующихсяРегистров(Регистратор, ДокументыОснования)
	
	МассивИменРегистров = Новый Массив;
	
	Для каждого Стр Из ДокументыОснования Цикл
		
		Если ТипЗнч(Стр.ДокументОснование) = ТИП("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			МассивИменРегистров.Добавить("торо_СтатусыДокументовВыявленныхДефектов");
		ИначеЕсли ТипЗнч(Стр.ДокументОснование) = ТИП("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			МассивИменРегистров.Добавить("торо_СтатусыДокументовВнешнихОснований");
		ИначеЕсли ТипЗнч(Стр.ДокументОснование) = ТИП("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			МассивИменРегистров.Добавить("торо_СтатусыДокументовЗаявок");
		ИначеЕсли ТипЗнч(Стр.ДокументОснование) = ТИП("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			МассивИменРегистров.Добавить("торо_СтатусыДокументовНарядовНаРемонтныеРаботы");
		ИначеЕсли ТипЗнч(Стр.ДокументОснование) = ТИП("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
			МассивИменРегистров.Добавить("торо_СтатусыДокументовНарядовНаМероприятия");
		КонецЕсли;
		
	КонецЦикла;
	
	МассивИспользующихсяРегистров = Новый Массив;
	
	Для Каждого Регистр Из Регистратор.Метаданные().Движения Цикл
		Если МассивИменРегистров.Найти(Регистр.Имя) <> Неопределено Тогда
			МассивИспользующихсяРегистров.Добавить(Регистр.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИспользующихсяРегистров;
	
КонецФункции

Процедура ЗаписатьДвиженияРегистратора(Движения, ИменаИспользующихсяРегистров)
	
	Для Каждого ИмяРегистра Из ИменаИспользующихсяРегистров Цикл
		Выполнить("Движения." + ИмяРегистра + ".Записать()");
		Выполнить("Движения." + ИмяРегистра + "Установленные.Записать()");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДокументыОснования(Регистратор, ДокументыОснования)
	
	ТипДокумента = ТипЗнч(Регистратор);
	
	Если ТипДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник КАК ДокументОснование
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ДокументВнешнегоОснования
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ЗакрываемыеПредписания КАК торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НС = ДокументыОснования.Добавить();
			НС.ДокументОснование = ВыборкаДетальныеЗаписи.ДокументОснование;
			ПолучитьДокументыОснования(ВыборкаДетальныеЗаписи.ДокументОснование, ДокументыОснования);
			
		КонецЦикла;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")
		Или ТипДокумента = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")
		Или ТипДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
		ИЛИ ТипДокумента = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
		Тогда
		
		Для Каждого Строка Из Регистратор.ДокументыОснования Цикл
			НС = ДокументыОснования.Добавить();
			НС.ДокументОснование = Строка.ДокументОснование;
			ПолучитьДокументыОснования(Строка.ДокументОснование, ДокументыОснования);
		КонецЦикла;
		
		Если ТипДокумента = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")
			Или ТипДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			Для Каждого Строка Из Регистратор.ЗакрываемыеПредписания Цикл
				НС = ДокументыОснования.Добавить();
				НС.ДокументОснование = Строка.ДокументВнешнегоОснования;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
		ЗакрываемыеРемонты = Регистратор.ЗакрываемыеРемонты.Выгрузить(,"ID");
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗакрываемыеРемонты.ID
		               |ПОМЕСТИТЬ ЗакрываемыеРемонты
		               |ИЗ
		               |	&ЗакрываемыеРемонты КАК ЗакрываемыеРемонты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_Ремонты.Регистратор
		               |ПОМЕСТИТЬ Регистраторы
		               |ИЗ
		               |	ЗакрываемыеРемонты КАК ЗакрываемыеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
		               |		ПО (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
		               |				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		               |				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
		               |			И ЗакрываемыеРемонты.ID = торо_Ремонты.ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Регистраторы.Регистратор КАК ДокументОснование
		               |ИЗ
		               |	Регистраторы КАК Регистраторы";
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("ЗакрываемыеРемонты", ЗакрываемыеРемонты);
			ДокументыОснования = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке(Регистратор, ДокументыОснования)

	ТипДокументаСтрока = ПолучитьТипДокументаКакСтроку(Регистратор);
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(Регистратор) = ТИП("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		ЗавершитьРемонтныеРаботы = Регистратор.ЗавершитьРемонтныеРаботы;
	Иначе
		ЗавершитьРемонтныеРаботы = Ложь;
	КонецЕсли;
	
	ТаблицаУстанавливаемыхСтатусов = торо_РаботаСоСтатусамиДокументовПовтИсп.ПолучитьТаблицуУстанавливаемыхСтатусов(ТипДокументаСтрока, ДокументыОснования, ЗавершитьРемонтныеРаботы);
	
	Возврат ТаблицаУстанавливаемыхСтатусов;
		
КонецФункции

Функция ПолучитьТипДокументаКакСтроку(Ссылка)
	
	ТипДокумента = ТипЗнч(Ссылка);
	Если ТипДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		Возврат "ДокументСсылка.торо_ЗаявкаНаРемонт";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		Возврат "ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		Возврат "ДокументСсылка.торо_АктОВыполненииЭтапаРабот";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		Возврат "ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
		Возврат "ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		Возврат "ДокументСсылка.торо_ВыявленныеДефекты";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		Возврат "ДокументСсылка.торо_ВнешнееОснованиеДляРабот";
	КонецЕсли;
	
КонецФункции

Функция ДоступнаРоль(ИмяРоли) Экспорт
	
	Возврат РольДоступна(ИмяРоли);
	
КонецФункции

Процедура ЗаполнитьМассивИзДерева(Массив, ЭлементыДерева)
	
	Для каждого Элемент Из ЭлементыДерева Цикл
		Массив.Добавить(Элемент);
		Если Элемент.ПолучитьЭлементы().Количество() > 0 Тогда
			ЗаполнитьМассивИзДерева(Массив, Элемент.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#Область ФормированиеТекстовЗапросов

Функция ПолучитьТекстЗапросаТаблицыДокументовДляУстановкиФлагаПриОтменеПроведения(ИмяРегистра, Первый, ИмяВременнойТаблицы = "")
	
	Если первый Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	торо_СтатусыДокументов.Период,
	|	торо_СтатусыДокументов.Регистратор,
	|	торо_СтатусыДокументов.ИзменяемыйДокумент,
	|	торо_СтатусыДокументов.СтатусДокумента,
	|	торо_СтатусыДокументов.СтатусУстановлен
	|%ИспользоватьВременнуюТаблицу%
	|ИЗ
	|	ЗаписиПоРегистратору КАК ЗаписиПоРегистратору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистра + " КАК торо_СтатусыДокументов
	|		ПО ((ВЫРАЗИТЬ(ЗаписиПоРегистратору.ИзменяемыйДокумент КАК Документ." + ТипДокументаДляЗапросаПоИмениРегистра(ИмяРегистра) + ")) = торо_СтатусыДокументов.ИзменяемыйДокумент)
	|			И торо_СтатусыДокументов.Регистратор <> &Регистратор"; 
	
	Если ИмяВременнойТаблицы = "" Тогда
		ТекстЗапроса = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
	
Функция ОбъединениеРегистровИОснований(ИменаИспользующихсяРегистров)
	
	ТекстЗапросаДокОсн = "";
	ТекстЗапроса = "";
	
	ВоВременнуюТаблицу = Истина;
	Для Каждого ИмяРегистра Из ИменаИспользующихсяРегистров Цикл
		
		ДобТекст = ПолучитьТекстВыраженияТаблицыДокОсн(ИмяРегистра); 
		
		Если ВоВременнуюТаблицу Тогда
			ДобавляемыйТекст = ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, Ложь, Истина, Истина,, "ДокументыОснованияСРегистрами");
			ВоВременнуюТаблицу = Ложь;
		Иначе
			ДобавляемыйТекст = ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, Ложь, Истина, Истина);
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ДобавляемыйТекст;
		ТекстЗапросаДокОсн = ТекстЗапросаДокОсн + Символы.ПС + ДобТекст;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапросаДокОсн + ТекстЗапроса;
	
	Если НЕ ВоВременнуюТаблицу Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИНДЕКСИРОВАТЬ ПО
		|	СтатусДокумента
		|;";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстВыраженияТаблицыДокОсн(ИмяРегистра)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокументыОснования.ДокументОснование
	|ПОМЕСТИТЬ ДокументыОснования" + ИмяРегистра + "
	|	ИЗ ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ВЫРАЗИТЬ(ДокументыОснования.ДокументОснование КАК Документ." 
		+ ТипДокументаДляЗапросаПоИмениРегистра(ИмяРегистра) 
		+ ") ССЫЛКА Документ." + ТипДокументаДляЗапросаПоИмениРегистра(ИмяРегистра) + "
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, 
													ПоДокументу = Истина,
													ОбъединитьСОснованиями = Ложь,
													КромеРегистратора = Ложь,
													ПоРегистратору = Ложь, 
													ИмяВременнойТаблицы = "",
													ОбъединитьВсе = Истина)
		
	Если ОбъединитьСОснованиями Тогда
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента";
		
	Иначе
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.Период,
		|	торо_СтатусыДокументовСрезПоследних.Регистратор,
		|	торо_СтатусыДокументовСрезПоследних.НомерСтроки,
		|	торо_СтатусыДокументовСрезПоследних.Активность,
		|	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента,
		|	торо_СтатусыДокументовСрезПоследних.СтатусУстановлен";
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ " + ВыбираемыеПоля + 
	" %ИспользоватьВременнуюТаблицу%
	|ИЗ
	|	РегистрСведений." + ИмяРегистра + ".СрезПоследних(
	|			,
	|			СтатусУстановлен = ИСТИНА %Условие1% %Условие2% %Условие3%) КАК торо_СтатусыДокументовСрезПоследних";
	
	ЕстьПредыдущееУсловие = Ложь;
	
	Если ПоДокументу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," И ИзменяемыйДокумент = &Документ ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," ");
	КонецЕсли;
	
	Если КромеРегистратора Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор <> &Регистратор ");
	ИначеЕсли ПоРегистратору Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор = &Регистратор ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," ");
	КонецЕсли;
	
	Если ОбъединитьСОснованиями Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," И ИзменяемыйДокумент В
		|(ВЫБРАТЬ
		|	ДокументыОснования.ДокументОснование
		|ИЗ
		|	ДокументыОснования" + ИмяРегистра + " КАК ДокументыОснования) ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," ");
	КонецЕсли;
	
	Если ИмяВременнойТаблицы = "" Тогда
		Если ОбъединитьВсе Тогда
			ТекстЗапроса = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ТипДокументаДляЗапросаПоИмениРегистра(ИмяРегистра)
	
	Если ИмяРегистра = "торо_СтатусыДокументовВыявленныхДефектов" Тогда
		Возврат "торо_ВыявленныеДефекты";
	ИначеЕсли ИмяРегистра = "торо_СтатусыДокументовЗаявок" Тогда
		Возврат "торо_ЗаявкаНаРемонт";
	ИначеЕсли ИмяРегистра = "торо_СтатусыДокументовВнешнихОснований" Тогда
		Возврат "торо_ВнешнееОснованиеДляРабот";
	ИначеЕсли ИмяРегистра = "торо_СтатусыДокументовНарядовНаРемонтныеРаботы" Тогда
		Возврат "торо_НарядНаВыполнениеРемонтныхРабот";
	ИначеЕсли ИмяРегистра = "торо_СтатусыДокументовНарядовНаМероприятия" Тогда
		Возврат "торо_НарядНаРегламентноеМероприятие";
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#КонецОбласти
